       01 ProduitEpargne.
           10 CodeProduit        SQL CHAR(2).
           10 FraisEntree        PIC 99V99.
           10 FraisVersement     PIC 99V99.
           10 FiscRachat         PIC 99V99.
           10 TauxRemuneration   PIC 99V99.
           10 SeuilEntree        PIC 9(12)V99.
           10 SeuilEntreeBrut    PIC 9(12)V99.
