       01 ProduitEpargne.
           05 ligneProduit OCCURS 3.
               10 CodeProduit       PIC XX.
               10 FraisEntree       PIC X(5).
               10 FraisVersement    PIC X(5).
               10 FiscRachat        PIC X(5).
               10 TauxRemuneration  PIC X(5).
               10 SeuilEntree       PIC X(12).
               10 SeuilEntreeBrut   PIC X(12).
